---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarCurvesData.Dispose
source: html/58cb8d3e-f37d-aa90-bb86-7faec1c4e638.htm
---
# Autodesk.Revit.DB.Structure.RebarCurvesData.Dispose Method

Releases all resources used by the RebarCurvesData

## Syntax (C#)
```csharp
public void Dispose()
```